___

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)
randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [3]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [4]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [5]:
df['W']

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [6]:
# Pass a list of column names
df[['W','Z','X']]

          W         Z         X
A  0.302665 -1.159119  1.693723
B -0.134841  0.184502  0.390528
C  0.807706  0.329646  0.072960
D -0.497104  0.484752 -0.754070
E -0.116773  1.996652  1.901755

In [7]:
# SQL Syntax (NOT RECOMMENDED!)
df.W

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

DataFrame Columns are just Series

In [8]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [9]:
df['new'] = df['W'] + df['Y']

In [10]:
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

** Removing Columns**

In [11]:
df.drop('new',axis=1)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [12]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A  0.302665  1.693723 -1.706086 -1.159119 -1.403420
B -0.134841  0.390528  0.166905  0.184502  0.032064
C  0.807706  0.072960  0.638787  0.329646  1.446493
D -0.497104 -0.754070 -0.943406  0.484752 -1.440510
E -0.116773  1.901755  0.238127  1.996652  0.121354

In [13]:
df.drop('new',axis=1,inplace=True)

In [14]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

Can also drop rows this way:

In [15]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752

** Selecting Rows**

In [16]:
df.loc['A']

W    0.302665
X    1.693723
Y   -1.706086
Z   -1.159119
Name: A, dtype: float64

Or select based off of position instead of label

In [17]:
df.iloc[2]

W    0.807706
X    0.072960
Y    0.638787
Z    0.329646
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [18]:
df.loc['B','Y']

0.16690463609281317

In [19]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  0.302665 -1.706086
B -0.134841  0.166905

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [20]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [21]:
df>0

       W      X      Y      Z
A   True   True  False  False
B  False   True   True   True
C   True   True   True   True
D  False  False  False   True
E  False   True   True   True

In [22]:
df[df>0]

          W         X         Y         Z
A  0.302665  1.693723       NaN       NaN
B       NaN  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D       NaN       NaN       NaN  0.484752
E       NaN  1.901755  0.238127  1.996652

In [23]:
df[df['W']>0]

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
C  0.807706  0.072960  0.638787  0.329646

In [24]:
df[df['W']>0]['Y']

A   -1.706086
C    0.638787
Name: Y, dtype: float64

In [25]:
df[df['W']>0][['Y','X']]

          Y         X
A -1.706086  1.693723
C  0.638787  0.072960

For two conditions you can use | and & with parenthesis:

In [26]:
df[(df['W']>0) & (df['Y'] > 0)]

          W        X         Y         Z
C  0.807706  0.07296  0.638787  0.329646

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [27]:
df

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [28]:
# Reset to default 0,1...n index
df.reset_index()

  index         W         X         Y         Z
0     A  0.302665  1.693723 -1.706086 -1.159119
1     B -0.134841  0.390528  0.166905  0.184502
2     C  0.807706  0.072960  0.638787  0.329646
3     D -0.497104 -0.754070 -0.943406  0.484752
4     E -0.116773  1.901755  0.238127  1.996652

In [29]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [30]:
df['States'] = newind
df['States1']=10

In [31]:
df

          W         X         Y         Z States  States1
A  0.302665  1.693723 -1.706086 -1.159119     CA       10
B -0.134841  0.390528  0.166905  0.184502     NY       10
C  0.807706  0.072960  0.638787  0.329646     WY       10
D -0.497104 -0.754070 -0.943406  0.484752     OR       10
E -0.116773  1.901755  0.238127  1.996652     CO       10

In [32]:
df.set_index('States')

               W         X         Y         Z  States1
States
CA      0.302665  1.693723 -1.706086 -1.159119       10
NY     -0.134841  0.390528  0.166905  0.184502       10
WY      0.807706  0.072960  0.638787  0.329646       10
OR     -0.497104 -0.754070 -0.943406  0.484752       10
CO     -0.116773  1.901755  0.238127  1.996652       10

In [33]:
df

          W         X         Y         Z States  States1
A  0.302665  1.693723 -1.706086 -1.159119     CA       10
B -0.134841  0.390528  0.166905  0.184502     NY       10
C  0.807706  0.072960  0.638787  0.329646     WY       10
D -0.497104 -0.754070 -0.943406  0.484752     OR       10
E -0.116773  1.901755  0.238127  1.996652     CO       10

In [34]:
df.set_index('States',inplace=True)

In [35]:
df

               W         X         Y         Z  States1
States
CA      0.302665  1.693723 -1.706086 -1.159119       10
NY     -0.134841  0.390528  0.166905  0.184502       10
WY      0.807706  0.072960  0.638787  0.329646       10
OR     -0.497104 -0.754070 -0.943406  0.484752       10
CO     -0.116773  1.901755  0.238127  1.996652       10

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [36]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [37]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [38]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1 -0.993263  0.196800
   2 -1.136645  0.000366
   3  1.025984 -0.156598
G2 1 -0.031579  0.649826
   2  2.154846 -0.610259
   3 -0.755325 -0.346419

Now let's show how to index this! For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[]. Calling one level of the index returns the sub-dataframe:

In [39]:
df.loc['G1']

          A         B
1 -0.993263  0.196800
2 -1.136645  0.000366
3  1.025984 -0.156598

In [40]:
df.loc['G1'].loc[[1]]

          A       B
1 -0.993263  0.1968

In [41]:
df.index.names

FrozenList([None, None])

In [42]:
df.index.names = ['Group','Num']

In [43]:
df

                  A         B
Group Num
G1    1   -0.993263  0.196800
      2   -1.136645  0.000366
      3    1.025984 -0.156598
G2    1   -0.031579  0.649826
      2    2.154846 -0.610259
      3   -0.755325 -0.346419

In [44]:
df.xs('G1')

            A         B
Num
1   -0.993263  0.196800
2   -1.136645  0.000366
3    1.025984 -0.156598

In [45]:
#df.xs(['G1',1])
df.xs(('G1',1))

A   -0.993263
B    0.196800
Name: (G1, 1), dtype: float64

In [46]:
df.xs(1,level='Num')

              A         B
Group
G1    -0.993263  0.196800
G2    -0.031579  0.649826

# Great Job!

In [47]:
np.random.seed(80)
randn(4,4)

array([[ 1.89985294,  0.20880295,  0.89521104, -1.18072916],
       [ 0.27353254,  0.60286724, -0.66136743, -1.04361074],
       [-0.58114897, -0.356353  ,  0.29407381, -1.79697064],
       [-0.38949016,  0.44914091, -0.47389926,  1.16380822]])

In [48]:
data=pd.DataFrame(randn(4,4),index='A B C D'.split(),columns='W X Y Z'.split())

In [49]:
data

          W         X         Y         Z
A -1.229812  0.986719 -0.816115 -1.758184
B  0.696212 -0.021395  0.501825  2.658438
C  1.086098 -0.163156  0.552802  2.289471
D -0.041776 -0.750391  0.174364 -1.574560

In [50]:
data['W']

A   -1.229812
B    0.696212
C    1.086098
D   -0.041776
Name: W, dtype: float64

In [51]:
data[['W','Z','X']]

          W         Z         X
A -1.229812 -1.758184  0.986719
B  0.696212  2.658438 -0.021395
C  1.086098  2.289471 -0.163156
D -0.041776 -1.574560 -0.750391

In [52]:
data.Y

A   -0.816115
B    0.501825
C    0.552802
D    0.174364
Name: Y, dtype: float64

In [53]:
data['NW']=data['W'] + data['Z']

In [54]:
data

          W         X         Y         Z        NW
A -1.229812  0.986719 -0.816115 -1.758184 -2.987996
B  0.696212 -0.021395  0.501825  2.658438  3.354651
C  1.086098 -0.163156  0.552802  2.289471  3.375570
D -0.041776 -0.750391  0.174364 -1.574560 -1.616336

In [55]:
data.drop('NW',axis=1)

          W         X         Y         Z
A -1.229812  0.986719 -0.816115 -1.758184
B  0.696212 -0.021395  0.501825  2.658438
C  1.086098 -0.163156  0.552802  2.289471
D -0.041776 -0.750391  0.174364 -1.574560

In [56]:
data

          W         X         Y         Z        NW
A -1.229812  0.986719 -0.816115 -1.758184 -2.987996
B  0.696212 -0.021395  0.501825  2.658438  3.354651
C  1.086098 -0.163156  0.552802  2.289471  3.375570
D -0.041776 -0.750391  0.174364 -1.574560 -1.616336

In [57]:
data.drop('NW',axis=1,inplace=True)

In [58]:
data

          W         X         Y         Z
A -1.229812  0.986719 -0.816115 -1.758184
B  0.696212 -0.021395  0.501825  2.658438
C  1.086098 -0.163156  0.552802  2.289471
D -0.041776 -0.750391  0.174364 -1.574560

In [59]:
data.drop('C',axis=0)

          W         X         Y         Z
A -1.229812  0.986719 -0.816115 -1.758184
B  0.696212 -0.021395  0.501825  2.658438
D -0.041776 -0.750391  0.174364 -1.574560

In [60]:
data.loc[['A']]

          W         X         Y         Z
A -1.229812  0.986719 -0.816115 -1.758184

In [61]:
data.iloc[[1]]

          W         X         Y         Z
B  0.696212 -0.021395  0.501825  2.658438

In [62]:
data.loc['B','X']

-0.02139537562525888

In [63]:
data.loc[['A','B'],['W','Y']]

          W         Y
A -1.229812 -0.816115
B  0.696212  0.501825

In [64]:
data

          W         X         Y         Z
A -1.229812  0.986719 -0.816115 -1.758184
B  0.696212 -0.021395  0.501825  2.658438
C  1.086098 -0.163156  0.552802  2.289471
D -0.041776 -0.750391  0.174364 -1.574560

In [65]:
data>0

       W      X      Y      Z
A  False   True  False  False
B   True  False   True   True
C   True  False   True   True
D  False  False   True  False

In [66]:
data[data>0]

          W         X         Y         Z
A       NaN  0.986719       NaN       NaN
B  0.696212       NaN  0.501825  2.658438
C  1.086098       NaN  0.552802  2.289471
D       NaN       NaN  0.174364       NaN

In [67]:
data[data['X']>1.2]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [68]:
data

          W         X         Y         Z
A -1.229812  0.986719 -0.816115 -1.758184
B  0.696212 -0.021395  0.501825  2.658438
C  1.086098 -0.163156  0.552802  2.289471
D -0.041776 -0.750391  0.174364 -1.574560

In [69]:
data.drop('Z',axis= 1,inplace=True)

In [70]:
data

          W         X         Y
A -1.229812  0.986719 -0.816115
B  0.696212 -0.021395  0.501825
C  1.086098 -0.163156  0.552802
D -0.041776 -0.750391  0.174364